# TargetDistance Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Camera..::..TargetDistance Property
Camera Class See Also
---
Distance from camera to its target
**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public double TargetDistance { get; set; }
```

Visual Basic
---
```text
Public Property TargetDistance As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double TargetDistance {
	double get ();
	void set (double value);
}
```

# See Also
Camera Class
Autodesk.Revit.DB.DirectContext3D Namespace